
//// just 25 Days
//// 3 Days ----
//// 10 * 25 = 250 每隔 3 Days 整理  1hour
//// 6 * 25 = 150 每隔 3 Days 整理   4hour
/***
///Video
////Stable
////BaseLib
////AutoTest
////Network
 */

/*** 05.06
 * 1、引用和指针 & *  ｜｜ 值传递、引用传递、指针传递
 * 2、static
 * 3、const
 * 4、mutable
 * 5、extern
 * 6、strcat\strcpy\strncpy\memset\memcpy
 * 7、深浅拷贝
 * 8、模版
 * 9、struct
 * 10、成员初始化列表
 *
 * 1、无重复字符的最长子串
 * 2、反转链表
 * 3、LRU缓存机制---页面置换算法（最近最少使用的页面淘汰）
 * 4、数组中的第K个最大元素
 * 5、K个一组反转列表
 * 6、三数之和
 * 7、最大子数组和---最大和的连续数组
 * 8、排序数组
 * 9、合并两个有序链表
 * 10、两数之和
 */
 /*** 05.07
  * 1、构造函数不能虚函数，析构可以虚函数
  * 2、类实现静态分配和动态分配
  * 3、合成默认构造函数和合成复制构造函数和移动构造
  * 4、类组合
  * 5、四种转换
  * 6、vector和list
  * 7、set\unordered_set\map\unordered_map
  * 8、函数指针
  * 9、内存分配
  * 10、智能指针
  * 11、迭代器有什么用处？泛型算法的参数为什么接收的都是迭代器？
  *
  * 1、最长回文字串
  * 2、二叉树层序遍历
  * 3、搜索旋转排序数组---nums在下标k进行了旋转
  * 4、买卖股票 1和2
  * 5、岛屿数量
  * 6、有效括号
  * 7、环形链表
  * 8、合并两个有序数组--m,n是元素数目
  * 9、全排列
  * 10、二叉树最近公共祖先
  */
