
//// just 25 Days
//// 3 Days ----
//// define 10 * 25 = 250 每隔 3 Days 整理  1hour
//// coding 6 * 25 = 150 每隔 3 Days 整理   4hour
//// coding top 1o page (2/10) + newest（15 page)
////
/***
///Video
////Stable
////BaseLib
////AutoTest
////Network
 */

/*** 05.06
 * 1、引用和指针 & *  ｜｜ 值传递、引用传递、指针传递
 * 2、static
 * 3、const
 * 4、mutable
 * 5、extern
 * 6、strcat\strcpy\strncpy\memset\memcpy
 * 7、深浅拷贝
 * 8、模版
 * 9、struct
 * 10、成员初始化列表
 *
 * 1、无重复字符的最长子串
 * 2、反转链表
 * 3、LRU缓存机制---页面置换算法（最近最少使用的页面淘汰）
 * 4、数组中的第K个最大元素
 * 5、K个一组反转列表
 * 6、三数之和
 * 7、最大子数组和---最大和的连续数组
 * 8、排序数组
 * 9、合并两个有序链表
 * 10、两数之和
 */

 /*** 05.07
  * 1、构造函数不能虚函数，析构可以虚函数
  * 2、类实现静态分配和动态分配
  * 3、合成默认构造函数和合成复制构造函数和移动构造
  * 4、类组合
  * 5、四种转换
  * 6、vector和list
  * 7、set\unordered_set\map\unordered_map
  * 8、函数指针
  * 9、内存分配
  * 10、智能指针
  * 11、迭代器有什么用处？泛型算法的参数为什么接收的都是迭代器？
  *
  * 1、最长回文字串
  * 2、二叉树层序遍历
  * 3、搜索旋转排序数组---nums在下标k进行了旋转
  * 4、买卖股票 1和2
  * 5、岛屿数量
  * 6、有效括号
  * 7、环形链表
  * 8、合并两个有序数组--m,n是元素数目
  * 9、全排列
  * 10、二叉树最近公共祖先
  */

  /*** 05.08
   * 1、基础pending one day
   *
   * 1、二叉树锯齿形层次遍历--二叉树锯齿形层次遍历-先左后右，再右后左
   * 2、反转链表2--反转指定位置
   * 3、螺旋矩阵
   * 4、合并K个链表
   * 5、相交链表
   * 6、最长上升子序列
   * 7、字符串相加
   * 8、接雨水
   * 9、重排链表
   * 10、环形链表2
   * 11、合并区间
   * 12、二叉树最大路径和
   * 13、删除链表的倒数第N个节点
   * 14、复原IP地址
   * 15、最长公共子序列
   * 16、二叉树中序遍历
   * 17、删除链表重复元素
   * 18、二分查找
   * 19、二叉树的右视图
   */

 /*** 05.09
  * 补充网络
  * review coding
  */

 /*** 05.10
  * 1、Video
  *
  * 1、寻找两个正序数组的中位数
  * 2、两个栈实现队列
  * 3、排序链表
  * 4、下一个排列
  * 5、x的平方根
  * 6、字符串转换为整数
  * 7、爬楼梯
  * 8、两数相加
  * 9、括号生成
  * 10、比较版本号
  */

 /*** 05.11
  * 1、Video -- camera
  * //需要补充ffmpeg Opengl es 相关 
  * //了解前处理的水印
  * //详细看一下渲染的代码
  * //基础知识
  * 
  * 1、Coding review
 */

  /*** 05.13
   * 1、Video
  */

  /*** 05.14
   * Autotest
   * 
   * 早 coding 晚coding
   * https://github.com/youngyangyang04/leetcode-master?tab=readme-ov-file
   * https://github.com/youngyangyang04/TechCPP?tab=readme-ov-file
  */
